TexasInstruments/enet-firmware/apps/app_remoteswitchcfg_server/sitara/avb_audio_source/am62dx-evm/r5fss0-0_freertos/example.syscfg
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.$name             = "REGISTER_REGION";

mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.size              = 7;
mpu_armv72.$name             = "TCMA_VEC";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv73.baseAddr          = 0x41C00000;
mpu_armv73.size              = 19;

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 16;

mpu_armv75.$name    = "DDR";
mpu_armv75.size     = 31;
mpu_armv75.baseAddr = 0x80000000;

mpu_armv76.baseAddr   = 0x41010000;
mpu_armv76.size       = 15;
mpu_armv76.attributes = "NonCached";
mpu_armv76.$name      = "TCMB";

mpu_armv77.size       = 15;
mpu_armv77.attributes = "NonCached";
mpu_armv77.$name      = "TCMA";

mpu_armv78.baseAddr = 0x43C00000;
mpu_armv78.size     = 18;
mpu_armv78.$name    = "HSM_RAM";

mpu_armv79.$name        = "RTOS_NORTOS_IPC_VRING1";
mpu_armv79.baseAddr     = 0x9B500000;
mpu_armv79.size         = 20;
mpu_armv79.attributes   = "NonCached";
mpu_armv79.allowExecute = false;

mpu_armv710.$name        = "RTOS_NORTOS_IPC_VRING2";
mpu_armv710.attributes   = "NonCached";
mpu_armv710.allowExecute = false;
mpu_armv710.size         = 24;
mpu_armv710.baseAddr     = 0x9B000000;

mpu_armv711.$name        = "FSS0_OSPI0_CTRL_REG";
mpu_armv711.baseAddr     = 0xFC40000;
mpu_armv711.size         = 8;
mpu_armv711.attributes   = "Device";
mpu_armv711.allowExecute = false;

mpu_armv712.$name        = "UART0_REG";
mpu_armv712.baseAddr     = 0x2800000;
mpu_armv712.size         = 9;
mpu_armv712.allowExecute = false;
mpu_armv712.attributes   = "Device";

mpu_armv713.$name      = "INTERCORE_REGION";
mpu_armv713.baseAddr   = 0xA4000000;
mpu_armv713.size       = 25;
mpu_armv713.attributes = "NonCached";

mpu_armv714.$name      = "AVB_SHM_MEM";
mpu_armv714.baseAddr   = 0xA3000000;
mpu_armv714.size       = 19;
mpu_armv714.attributes = "NonCached";

timer1.timerCallback = "avbTimerIsrClassA";
timer1.$name         = "CONFIG_TIMER1";

enet_cpsw1.$name                                       = "CONFIG_ENET_CPSW0";
enet_cpsw1.IsEthFw                                     = true;
enet_cpsw1.macAddrConfig                               = "Manual Entry";
enet_cpsw1.PktInfoOnlyEnable                           = true;
enet_cpsw1.cpswVlanAwareMode                           = true;
enet_cpsw1.hostportRxMtu                               = 1522;
enet_cpsw1.macport1RxMtu                               = 1522;
enet_cpsw1.vlanId_hostPort                             = 0x1;
enet_cpsw1.vlanId_macPort1                             = 0x3;
enet_cpsw1.macport2RxMtu                               = 1522;
enet_cpsw1.macOnlyEn_macPort2                          = true;
enet_cpsw1.enableTsOut                                 = true;
enet_cpsw1.LargePoolPktCount                           = 80;
enet_cpsw1.vlanMemberList_macPort1_MacPort2En          = false;
enet_cpsw1.unregMcastFloodMask_macPort1_MacPort2En     = false;
enet_cpsw1.regMcastFloodMask_macPort1_MacPort2En       = false;
enet_cpsw1.vlanMemberList_macPort2_MacPort1En          = false;
enet_cpsw1.unregMcastFloodMask_macPort2_MacPort1En     = false;
enet_cpsw1.regMcastFloodMask_macPort2_MacPort1En       = false;
enet_cpsw1.macAddrList                                 = "70:ff:76:1d:ec:f2,70:ff:76:1d:ec:e3,70:ff:76:1d:ec:e4,70:ff:76:1d:ec:e6,70:ff:76:1d:ec:e7,70:ff:76:1d:ec:e1";
enet_cpsw1.forceUntaggedEgressMask_macPort2_HostPortEn = true;
enet_cpsw1.forceUntaggedEgressMask_macPort2_MacPort2En = true;
enet_cpsw1.forceUntaggedEgressMask_macPort1_HostPortEn = true;
enet_cpsw1.forceUntaggedEgressMask_macPort1_MacPort1En = true;
enet_cpsw1.forceUntaggedEgressMask_hostPort_HostPortEn = true;
enet_cpsw1.forceUntaggedEgressMask_hostPort_MacPort1En = true;
enet_cpsw1.forceUntaggedEgressMask_hostPort_MacPort2En = true;
enet_cpsw1.nolearn_macPort2                            = true;
enet_cpsw1.txDmaChannel.create(3);
enet_cpsw1.txDmaChannel[0].$name                       = "ENET_DMA_TX_CH0";
enet_cpsw1.txDmaChannel[1].$name                       = "ENET_DMA_TX_CH_PTP";
enet_cpsw1.txDmaChannel[2].$name                       = "ENET_DMA_TX_CH_AVTP";
enet_cpsw1.rxDmaChannel.create(4);
enet_cpsw1.rxDmaChannel[0].$name                       = "ENET_DMA_RX_CH0";
enet_cpsw1.rxDmaChannel[0].useGlobalEvt                = true;
enet_cpsw1.rxDmaChannel[0].PacketsCount                = 16;
enet_cpsw1.rxDmaChannel[1].$name                       = "ENET_DMA_RX_CH1";
enet_cpsw1.rxDmaChannel[1].PacketsCount                = 16;
enet_cpsw1.rxDmaChannel[1].macAddrCount                = 0;
enet_cpsw1.rxDmaChannel[1].useGlobalEvt                = true;
enet_cpsw1.rxDmaChannel[1].useDefaultFlow              = false;
enet_cpsw1.rxDmaChannel[2].$name                       = "ENET_DMA_RX_CH_PTP";
enet_cpsw1.rxDmaChannel[2].PacketsCount                = 16;
enet_cpsw1.rxDmaChannel[2].macAddrCount                = 0;
enet_cpsw1.rxDmaChannel[2].useGlobalEvt                = true;
enet_cpsw1.rxDmaChannel[2].useDefaultFlow              = false;
enet_cpsw1.rxDmaChannel[3].$name                       = "ENET_DMA_RX_CH_AVTP";
enet_cpsw1.rxDmaChannel[3].useDefaultFlow              = false;
enet_cpsw1.rxDmaChannel[3].PacketsCount                = 16;
enet_cpsw1.rxDmaChannel[3].useGlobalEvt                = true;
enet_cpsw1.rxDmaChannel[3].macAddrCount                = 0;
enet_cpsw1.netifInstance.create(1);
enet_cpsw1.netifInstance[0].$name                      = "NETIF_INST_ID0";
enet_cpsw1.netifInstance[0].enableProxyArp             = true;
enet_cpsw1.netifInstance[0].proxyArpRxDmaChNum         = ["1"];

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY0";
enet_cpsw1.ethphy1       = ethphy_cpsw_icssg1;

const ethphy_cpsw_icssg2 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg2.$name = "CONFIG_ENET_ETHPHY1";
enet_cpsw1.ethphy2       = ethphy_cpsw_icssg2;

