TexasInstruments/enet-firmware/apps/app_remoteswitchcfg_server/sitara/avb_audio_source/am62dx-evm/r5fss0-0_freertos/example.syscfg
const udma2        = udma.addInstance({}, false);
enet_cpsw1.udmaDrv = udma2;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.serialFlashDriver.peripheralDriver.OSPI.$suggestSolution      = "OSPI0";
flash1.serialFlashDriver.peripheralDriver.OSPI.CLK.$suggestSolution  = "OSPI0_CLK";
flash1.serialFlashDriver.peripheralDriver.OSPI.CSn0.$suggestSolution = "OSPI0_CSn0";
flash1.serialFlashDriver.peripheralDriver.OSPI.DQS.$suggestSolution  = "OSPI0_DQS";
flash1.serialFlashDriver.peripheralDriver.OSPI.D7.$suggestSolution   = "OSPI0_D7";
flash1.serialFlashDriver.peripheralDriver.OSPI.D6.$suggestSolution   = "OSPI0_D6";
flash1.serialFlashDriver.peripheralDriver.OSPI.D5.$suggestSolution   = "OSPI0_D5";
flash1.serialFlashDriver.peripheralDriver.OSPI.D4.$suggestSolution   = "OSPI0_D4";
flash1.serialFlashDriver.peripheralDriver.OSPI.D3.$suggestSolution   = "OSPI0_D3";
flash1.serialFlashDriver.peripheralDriver.OSPI.D2.$suggestSolution   = "OSPI0_D2";
flash1.serialFlashDriver.peripheralDriver.OSPI.D1.$suggestSolution   = "OSPI0_D1";
flash1.serialFlashDriver.peripheralDriver.OSPI.D0.$suggestSolution   = "OSPI0_D0";
i2c1.I2C.SCL.$suggestSolution                                        = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution                                        = "I2C0_SDA";
mmcsd1.MMC0.$suggestSolution                                         = "MMC0";
mmcsd1.MMC0.CLK.$suggestSolution                                     = "MMC0_CLK";
mmcsd1.MMC0.CMD.$suggestSolution                                     = "MMC0_CMD";
mmcsd1.MMC0.DAT0.$suggestSolution                                    = "MMC0_DAT0";
mmcsd1.MMC0.DAT1.$suggestSolution                                    = "MMC0_DAT1";
mmcsd1.MMC0.DAT2.$suggestSolution                                    = "MMC0_DAT2";
mmcsd1.MMC0.DAT3.$suggestSolution                                    = "MMC0_DAT3";
mmcsd1.MMC0.DAT4.$suggestSolution                                    = "MMC0_DAT4";
mmcsd1.MMC0.DAT5.$suggestSolution                                    = "MMC0_DAT5";
mmcsd1.MMC0.DAT6.$suggestSolution                                    = "MMC0_DAT6";
mmcsd1.MMC0.DAT7.$suggestSolution                                    = "MMC0_DAT7";
uart1.UART.$suggestSolution                                          = "USART0";
uart1.UART.RXD.$suggestSolution                                      = "UART0_RXD";
uart1.UART.TXD.$suggestSolution                                      = "UART0_TXD";
debug_log.uartLog.WKUP_UART.$suggestSolution                         = "WKUP_USART0";
debug_log.uartLog.WKUP_UART.RXD.$suggestSolution                     = "WKUP_UART0_RXD";
debug_log.uartLog.WKUP_UART.TXD.$suggestSolution                     = "WKUP_UART0_TXD";
timer1.WKUP_TIMER.$suggestSolution                                   = "WKUP_DMTIMER0";
enet_cpsw1.MDIO.$suggestSolution                                     = "MDIO0";
enet_cpsw1.MDIO.MDC.$suggestSolution                                 = "MDIO0_MDC";
enet_cpsw1.MDIO.MDIO.$suggestSolution                                = "MDIO0_MDIO";
enet_cpsw1.RGMII1.$suggestSolution                                   = "RGMII2";
enet_cpsw1.RGMII1.RD0.$suggestSolution                               = "RGMII2_RD0";
enet_cpsw1.RGMII1.RD1.$suggestSolution                               = "RGMII2_RD1";
enet_cpsw1.RGMII1.RD2.$suggestSolution                               = "RGMII2_RD2";
enet_cpsw1.RGMII1.RD3.$suggestSolution                               = "RGMII2_RD3";
enet_cpsw1.RGMII1.RX_CTL.$suggestSolution                            = "RGMII2_RX_CTL";
enet_cpsw1.RGMII1.RXC.$suggestSolution                               = "RGMII2_RXC";
enet_cpsw1.RGMII1.TD0.$suggestSolution                               = "RGMII2_TD0";
enet_cpsw1.RGMII1.TD1.$suggestSolution                               = "RGMII2_TD1";
enet_cpsw1.RGMII1.TD2.$suggestSolution                               = "RGMII2_TD2";
enet_cpsw1.RGMII1.TD3.$suggestSolution                               = "RGMII2_TD3";
enet_cpsw1.RGMII1.TX_CTL.$suggestSolution                            = "RGMII2_TX_CTL";
enet_cpsw1.RGMII1.TXC.$suggestSolution                               = "RGMII2_TXC";
enet_cpsw1.RGMII2.$suggestSolution                                   = "RGMII1";
enet_cpsw1.RGMII2.RD0.$suggestSolution                               = "RGMII1_RD0";
enet_cpsw1.RGMII2.RD1.$suggestSolution                               = "RGMII1_RD1";
enet_cpsw1.RGMII2.RD2.$suggestSolution                               = "RGMII1_RD2";
enet_cpsw1.RGMII2.RD3.$suggestSolution                               = "RGMII1_RD3";
enet_cpsw1.RGMII2.RX_CTL.$suggestSolution                            = "RGMII1_RX_CTL";
enet_cpsw1.RGMII2.RXC.$suggestSolution                               = "RGMII1_RXC";
enet_cpsw1.RGMII2.TD0.$suggestSolution                               = "RGMII1_TD0";
enet_cpsw1.RGMII2.TD1.$suggestSolution                               = "RGMII1_TD1";
enet_cpsw1.RGMII2.TD2.$suggestSolution                               = "RGMII1_TD2";
enet_cpsw1.RGMII2.TD3.$suggestSolution                               = "RGMII1_TD3";
enet_cpsw1.RGMII2.TX_CTL.$suggestSolution                            = "RGMII1_TX_CTL";
enet_cpsw1.RGMII2.TXC.$suggestSolution                               = "RGMII1_TXC";
enet_cpsw1.CPSW_CPTS.$suggestSolution                                = "CP_GEMAC_CPTS0";
enet_cpsw1.CPSW_CPTS.TS_SYNC.$suggestSolution                        = "MMC1_DAT2";
